Patitioning documentation [GIVE4GOOD-843]
