--- a/wiki/calculator.md
+++ b/wiki/calculator.md
@@ -87,65 +87,80 @@ For the event that preceded the start state (at t=0), the [NONE](./events/NONE.m
 
 Currently, calculated models are not cached, but are parameterized.
 
-```mermaid
-graph LR
-    classDef calc fill:#ffc;
-    Options --> AggregatedDonationsAndTransfers
-    Donations2 --> AggregatedDonationsAndTransfers
-    Options --> AmountsToTransfer
-    Charities --> AmountsToTransfer
-    CharityFractionSets --> AmountsToTransfer
-    Index --> AuditHistory
-    HistoryHash --> AuditHistory
-    CharityBalance
-    OptionWorths2 --> CumulativeInterest
-    Donations2 --> DonationStatistics
-    Options --> DonationStatistics
-    OptionWorths2 --> DonationStatistics
-    Options --> IdealOptionValuations
-    OptionWorths2 --> IdealOptionValuations
-    Options --> MinimalExits
-    IdealOptionValuations --> MinimalExits
-    CumulativeInterest --> OptionWorthHistory
-    OptionWorthHistory --> IdealOptionValuations
-    Index --> ValidationErrors
-    Donations2 --> ValidationErrors
-    Charities --> ValidationErrors
-    Options --> ValidationErrors
-    AmountsToTransfer --> ValidationErrors
-    CharityBalance --> ValidationErrors
-    Options --> MonthlyDonations
+```plantuml
+skinparam component {
+    style rectangle
+    backgroundColor<<Calculator>> #ffffcc
+    backgroundColor<<Partitioned>> #ffcccc
+}
+    component Donations2 << Partitioned >> 
+    component Donors2 << Partitioned >>
+    component OptionWorths2 << Partitioned >>
+    component DonorDashboardStats2 << Calculator >>
+    component DonationExistence << Calculator >>
+    component DonationRecords2 << Calculator >>
 
-    OptionWorths2 --> OptionWorthHistory
-    OptionWorths2 --> CharityFractionSets
-    Donations2 --> CharityFractionSets
-    Donors2 --> DonorDashboardStats2:::calc
-    Donations2 --> DonorDashboardStats2
-    DonationRecords2 --> DonorDashboardStats2
-    Donations2 --> DonationExistence:::calc
-    CharityFractionSets --> Allocations
+    [Options] -[hidden]r-> [Donations2]
 
-    Donations2 --> DonationRecords2:::calc
-    OptionWorths2 --> DonationRecords2
-    OptionWorthHistory --> DonationRecords2
+    [Options] --> [AggregatedDonationsAndTransfers]
+    [Options] --> [AmountsToTransfer]
+    [Options] --> [DonationStatistics]
+    [Options] --> [MinimalExits]
+    [Options] --> [IdealOptionValuations]
+    [Options] --> [ValidationErrors]
+    [Options] --> [MonthlyDonations]
+    [Donations2] --> [AggregatedDonationsAndTransfers]
+    [Donations2] --> [DonationStatistics]
+    [Donations2] --> [ValidationErrors]
+    [Donations2] --> [CharityFractionSets]
+    [Donations2] --> [DonorDashboardStats2]
+    [Donations2] --> [DonationExistence] 
+    [Donations2] ----> [DonationRecords2] 
 
-    click Index "./models/index"
-    click HistoryHash "./models/history_hash"
-    click Options "./models/options"
-    click ValidationErrors "./models/validation_errors"
-    click Donations2 "./models/donations"
-    click OptionWorths2 "./models/option_worths"
-    click IdealOptionValuations "./models/ideal_option_valuations"
-    click MinimalExits "./models/minimal_exits"
-    click MonthlyDonations "./models/monthly_donations"
+    [Donors2] --> [DonorDashboardStats2]
+    [DonationRecords2] --> [DonorDashboardStats2]
+    [Charities] --> [AmountsToTransfer]
+    [Charities] --> [ValidationErrors]
+    [CharityFractionSets] --> [AmountsToTransfer]
+    [CharityFractionSets] --> [Allocations]
+    [Index] -l-> [ValidationErrors]
+    [Index] --> [AuditHistory]
+    [HistoryHash] --> [AuditHistory]
+    [OptionWorths2] --> [CumulativeInterest]
+    [OptionWorths2] --> [DonationStatistics]
+    [OptionWorths2] --> [IdealOptionValuations]
+    [OptionWorths2] --> [OptionWorthHistory]
+    [OptionWorths2] --> [CharityFractionSets]
+    [OptionWorths2] --> [DonationRecords2]
+    [IdealOptionValuations] --> [MinimalExits]
+    [CumulativeInterest] --> [OptionWorthHistory]
+    [OptionWorthHistory] --> [IdealOptionValuations]
+    [AmountsToTransfer] --> [ValidationErrors]
+    [CharityBalance] --> [ValidationErrors]
+
+    [OptionWorthHistory] --> [DonationRecords2]
+
+    url for AmountsToTransfer is [[models/amounts_to_transfer]]
+    url for DonorDashboardStats2 is [[models/donor_dashboard_stats]]
+    url for Donors2 is [[models/donors]]
+    url for Index is [[models/index]]
+    url for HistoryHash is [[models/history_hash]]
+    url for Options is [[models/options]]
+    url for ValidationErrors is [[models/validation_errors]]
+    url for Donations2 is [[models/donations]]
+    url for OptionWorths2 is [[models/option_worths]]
+    url for IdealOptionValuations is [[models/ideal_option_valuations]]
+    url for MinimalExits is [[models/minimal_exits]]
+    url for MonthlyDonations is [[models/monthly_donations]]
 ```
 
-_A data flow graph for all the models. 
-Blue is processed, yellow is calculated_
